In [7]:
import csv
import pandas as pd
import numpy as np

file = pd.read_csv('titanic.csv')
file.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [8]:
list_para = ['age','sex','pclass','survived']
file = file[list_para]
file = file.dropna()
file.head()

       age     sex  pclass  survived
0  29.0000  female       1         1
1   0.9167    male       1         1
2   2.0000  female       1         0
3  30.0000    male       1         0
4  25.0000  female       1         0

In [9]:
gender = {'female': 0, 'male': 1}
lis = []
for i in file.index:
    lis.append(np.array([file.age[i], file.age[i], gender[file.sex[i]], file.pclass[i]]))

In [10]:
row = np.array(lis)
survived = np.array(file.survived)

In [11]:
TRAIN = 0.8

In [12]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

row_train, row_test, survived_train, survived_test = train_test_split(row, survived, test_size = 0.25, random_state = 42)
print(len(row_train), len(row_test), len(survived_train), len(survived_test))

784 262 784 262

In [13]:
model = LogisticRegression()
model.fit(row_train, survived_train)
survived_prediction = model.predict(row_test)
result = list(zip(survived_test, survived_prediction))

In [14]:
accuracy = accuracy_score(survived_test, survived_prediction)
print("Accuracy:", round(accuracy*100, 2), "%")

Accuracy: 75.57 %